DataProcessors/ОбработкаЗагрузитьСудыПоДоговоруИзФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаЗагрузитьСудыПоДоговоруИзФайла</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РегистрСведенийСоответствиеСудДоговорИзФайла.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегистрСведенийСоответствиеСудДоговорИзФайла</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Суд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Суды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипСуда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипСуда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мировой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РайонныйГородской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбластнойКраевой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Суды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Суды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСуда</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипСуда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ОбработкаЗагрузитьСудыПоДоговоруИзФайла/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	  ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= ИмяФайла; //АДРЕС
	//ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	//ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	

	
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайл(Команда)
	
	Файл = Новый Файл(ИмяФайла);
	Если НЕ Файл.Существует() Тогда
		Возврат;
	КонецЕсли;

	 ОбработатьНаСервере();
	
	
КонецПроцедуры



&НаСервере
Процедура ОбработатьНаСервере()

	   ФайлДанных = ИмяФайла;
		
	   ФайлЕксел.Прочитать(ИмяФайла,СпособЧтенияЗначенийТабличногоДокумента.Текст);
		
	
	   ПЗ = Новый ПостроительЗапроса;

	   ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ФайлЕксел.Область());

	   ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;

	   ПЗ.ЗаполнитьНастройки();

	   ПЗ.Выполнить();

	   ТаблицаЗначений = ПЗ.Результат.Выгрузить();
 
	   
	     Для каждого стр Из ТаблицаЗначений Цикл

			 Если стр.НаименованиеУчастка<>"" Тогда
			 
			 	     Попытка
				  стрСуд=НайтиПодобный30вБазе(стр.НаименованиеУчастка);
				  
				  
			  
			      новаястр=ТЧ.Добавить(); 
				  
				  
				  //стр.ID_CONTRACT
				 новаястр.ИДКРЕДДОГ=стр.ID_CONTRACT;
				 новаястр.НазваниеСудаВФайле=стр.НаименованиеУчастка;
			   	 новаястр.АдресСудаВФайле=стр.АдресУчастка;
				 
				 новаястр.НазваниеСудаВБазе=стрСуд.НаименованиеСуда;
				 новаястр.АдресСудаВБазе=стрСуд.АдресСуда;
				 
				 новаястр.Наименование__=стр.НаименованиеУчастка;
				 
				 Если стрСуд.НаименованиеСуда<>"нет совпадений" Тогда
				 
				 	    новаястр.СсылкаСуд=стрСуд.СсылкаСуда;
				 
				 КонецЕсли;
				 
				     
				 
				 
			   
			  
			 	
			 
			 Исключение
				 
				 ТекстОшибки = ОписаниеОшибки();
				 
				 Сообщить(ТекстОшибки);
				 
				 Сообщить(стр.НаименованиеУчастка);
				 
			 КонецПопытки;

			 
			 КонецЕсли;
			 
						 
						   
						  
			 
		 КонецЦикла;

	   
	
	

КонецПроцедуры

&НаСервере
Функция НайтиПодобный30вБазе(стрпр)

	  стрСуд=Новый Структура; 
	
	 Если СтрДлина(стрпр)>29 Тогда 
	      стр30=Лев(стрпр,30);
		  
		  
		      	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
				// Данный фрагмент построен конструктором.
				// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Суды.Наименование КАК Наименование,
					|	Суды.Адрес КАК Адрес,
					|	Суды.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Суды КАК Суды
					|ГДЕ
					|	Суды.Наименование ПОДОБНО &Наименование";
				
				
				Запрос.УстановитьПараметр("Наименование", стр30+"%");

				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							
							стрСуд.Вставить("НаименованиеСуда",ВыборкаДетальныеЗаписи.Наименование);
							стрСуд.Вставить("АдресСуда",ВыборкаДетальныеЗаписи.Адрес);
							стрСуд.Вставить("СсылкаСуда",ВыборкаДетальныеЗаписи.Ссылка);
							
							
							
				        КонецЦикла;

					
				Иначе	
					
										инд=Найти(стр30,"№");
									   
										
										Если инд>0 Тогда
											
											
										   стрдономера=Лев(стр30,инд);
										    симв=Сред(стр30,инд+1,1);
											
											Если симв=" " Тогда
												
												длинаСтр=СтрДлина(стр30);
												
												стрПосленомера=Прав(стр30,длинаСтр-(инд+1));
												
												стрпоискНовый= стрдономера+стрПосленомера;
												
												
												Запрос = Новый Запрос;
												Запрос.Текст = 
													"ВЫБРАТЬ
													|	Суды.Наименование КАК Наименование,
													|	Суды.Адрес КАК Адрес,
													|	Суды.Ссылка КАК Ссылка
													|ИЗ
													|	Справочник.Суды КАК Суды
													|ГДЕ
													|	Суды.Наименование ПОДОБНО &Наименование";
												
												
												Запрос.УстановитьПараметр("Наименование", стрпоискНовый+"%");

												
												РезультатЗапроса = Запрос.Выполнить();
												
												Выборка = РезультатЗапроса.Выбрать();

												Если Выборка.Количество()>0 Тогда
												       Пока Выборка.Следующий() Цикл
															
															стрСуд.Вставить("НаименованиеСуда",Выборка.Наименование);
															стрСуд.Вставить("АдресСуда",Выборка.Адрес);
															стрСуд.Вставить("СсылкаСуда",Выборка.Ссылка);
															
												        КонецЦикла;

													
												 Иначе
													  стрСуд.Вставить("НаименованиеСуда","нет совпадений");
								                      стрСуд.Вставить("АдресСуда","нет адреса");

													 
												
												КонецЕсли;
												
												 
											Иначе	
												
											  стрСуд.Вставить("НаименованиеСуда","нет совпадений");
								              стрСуд.Вставить("АдресСуда","нет адреса");

											
												
											КонецЕсли;	
											
										Иначе 	
											
											  стрСуд.Вставить("НаименованиеСуда","нет совпадений");
								              стрСуд.Вставить("АдресСуда","нет адреса");
      
											
											
										КонецЕсли;
											
				   
					    							
							   
							
					КонецЕсли;
						   
					
					
													
			Иначе		
				
				стр30=Лев(стрпр,25);
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	Суды.Наименование КАК Наименование,
					|	Суды.Адрес КАК Адрес,
					|	Суды.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.Суды КАК Суды
					|ГДЕ
					|	Суды.Наименование ПОДОБНО &Наименование";
				
				
				Запрос.УстановитьПараметр("Наименование", стр30+"%");

				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
					
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							
							
							стрСуд.Вставить("НаименованиеСуда",ВыборкаДетальныеЗаписи.Наименование);
							стрСуд.Вставить("АдресСуда",ВыборкаДетальныеЗаписи.Адрес);
							стрСуд.Вставить("СсылкаСуда",ВыборкаДетальныеЗаписи.Ссылка);
							
				        КонецЦикла;

					
				Иначе	

					  стрСуд.Вставить("НаименованиеСуда","нет совпадений");
					  стрСуд.Вставить("АдресСуда","нет адреса");
      

						 							
               КонецЕсли;
					
				
			КонецЕсли;
				
							
				//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

					  
				  
				  
				  
		
	
	     Возврат стрСуд;	
	

КонецФункции // ()

&НаСервере
Процедура ЗагрузитьВБазуНаСервере()
	
	   
	
	    Для каждого стртабл Из ТЧ Цикл
			
			НачатьТранзакцию();
			
			Попытка
				
					//записать   РегистрСведенийСоответствиеСудДоговорИзФайла
					
					Если стртабл.НазваниеСудаВБазе<>"нет совпадений"  Тогда
						
						   // суд есть 
						   
						   МенеджерЗаписи = РегистрыСведений.РегистрСведенийСоответствиеСудДоговорИзФайла.СоздатьМенеджерЗаписи();
						   МенеджерЗаписи.Договор=ДоговорВернуть(стртабл.ИДКРЕДДОГ);
						   МенеджерЗаписи.Суд=стртабл.СсылкаСуд;
						   МенеджерЗаписи.ДатаЗагрузки=ТекущаяДата();
						   МенеджерЗаписи.Записать();
						
					Иначе	
						
						   //создать суд
						   новаязаписьСпр=Справочники.Суды.СоздатьЭлемент();
						   новаязаписьСпр.Наименование=стртабл.НазваниеСудаВФайле;
						   новаязаписьСпр.Адрес=стртабл.АдресСудаВФайле;
						   новаязаписьСпр.ТипСуда=Перечисления.ТипСуда.Мировой;
						   новаязаписьСпр.Записать();
						   
						   	   
						   МенеджерЗаписи = РегистрыСведений.РегистрСведенийСоответствиеСудДоговорИзФайла.СоздатьМенеджерЗаписи();
						   МенеджерЗаписи.Договор=ДоговорВернуть(стртабл.ИДКРЕДДОГ);
						   МенеджерЗаписи.Суд=новаязаписьСпр;
						   МенеджерЗаписи.ДатаЗагрузки=ТекущаяДата();
						   МенеджерЗаписи.Записать();
						   
						   
						
						
					
					КонецЕсли;
					
					
                   ЗафиксироватьТранзакцию();
				
			
			Исключение
				 ОтменитьТранзакцию();
				 
				 Ошибка=ОписаниеОшибки();
				 Сообщить(Ошибка);
				 
				
			КонецПопытки;
			
					
			
		
			
		
		КонецЦикла;
	
	    

	
	
	
	
КонецПроцедуры


&НаСервере
Функция ДоговорВернуть(номер)

	            
	          	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	Договоры.Ссылка КАК Ссылка
				|ИЗ
				|	Справочник.Договоры КАК Договоры
				|ГДЕ
				|	Договоры.НомерДоговора = &НомерДоговора";
			
			Запрос.УстановитьПараметр("НомерДоговора", номер);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				// Вставить обработку выборки ВыборкаДетальныеЗаписи
				
				догСсылка=ВыборкаДетальныеЗаписи.Ссылка;
				
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	     Возврат догСсылка;

КонецФункции // ()

	

&НаКлиенте
Процедура ЗагрузитьВБазу(Команда)
	 	
	
	
	
	ЗагрузитьВБазуНаСервере();
	
	Сообщить("Ок");
КонецПроцедуры
